import json

if __name__ == "__main__":
    res = json.loads(
        '{"首发症状时间": "2022-06-10", "治疗用药名称": "肺癌靶向药物", "RET": ["缺失", "阳性"], "TPS": "10%", "基因检测日期": "2021-06-13", "手术部位": "其他", "IC": "20%", "入院日期": "2019-06-06", "肿瘤具体治疗方式": "免疫", "传染性疾病": "乙型肝炎", "性别": "未知", "BRCA": ["阳性", "BRCA2"], "循环系统疾病": "动脉粥样硬化", "泌尿生殖系统疾病": "肾囊肿", "STK11": "阳性", "免疫检测日期": "2023-12-04", "NTRK": ["阳性", "融合"], "治疗结束日期": "2024-03-19", "HER4（ERBB4）": "阳性", "疾病名称": "神经内分泌癌", "KRAS": ["扩增", "G12X"], "第一次治疗时间（药物、放疗等）": "2023-08-10", "脑转部位": "无脑转", "治疗开始日期": "2024-03-16", "ALK": ["阳性", "插入"], "疾病首次确诊日期": "2020-02-29", "KEAP1": "阳性", "脑转移日期": "2018-07-12", "病史采集日期": "2023-09-21", "呼吸系统疾病": "血胸", "第一次影像确诊时间": "2022-05-24", "消化系统疾病": "结核", "CPS": "15%", "RB1": "阳性", "第一次切肺手术时间": "2018-02-13", "PDL1": "25%", "BRAF": ["非V600", "V600E"], "TP53": "阳性"}'
    )
    print(res)
    with open('data/extract100_zh.json', 'r', encoding='utf-8') as f:
        data = json.load(f)
        for item in data:
            item["output"] = json.dumps(item.get("output"),ensure_ascii=False)
    with open('data/extract100_zh.json', 'w', encoding='utf-8') as f:
        json.dump(data, f, ensure_ascii=False)
    print("Hello, World!")
