sft_unit_prompt = {
    "肿瘤治疗": """你的任务是从输入报告中提取‘肿瘤治疗’相关信息，报告中未提及的信息输出NA。输出格式:
        [{'治疗开始日期': 若没有明确指出开始日期，不输出。
        '治疗结束日期': 若没有明确指出结束日期，不输出治疗结束日期字段
        '肿瘤具体治疗方式': 可选项为['手术','消融','胸腔灌注','心包灌注','粒子植入','介入治疗','放疗','同步放化疗''化疗','靶向','免疫','PDL1','PD1','CLT-4','溶瘤病毒','肿瘤疫苗','抗血管','内分泌','细胞疗法','器官移植','干细胞移植','CAR-T','TIL']。只有明确提到'同步放化疗'的才选'同步放化疗'
        '治疗用药名称':  以列表形式列出,只提取治疗用药的药品名称
        '手术部位': 可选项为['切肺','脑转移','肝转移','其他']
        }//如果有多条肿瘤治疗，继续以相同方式列出。] \n输入报告：""",
    "体征数据": """你的任务是从输入报告中提取'体征数据'的相关信息，原报告中没有明确提到的信息输出'NA',按照下列格式输出：
        [{
            "ECOG日期": ''
            "ECOG": 可选项为['0','1','2','3','4','5']
        }]
        输入报告：
    """,
    "病理": """你的任务是从输入报告中识别'病理'的相关信息。如果报告中有多次病理检测，继续以输出格式要求输出到列表中，只关注明确提及的病理检测，不关注基于影像学诊断的结果。
        输出格式：[{
        "病理日期": ''
        "病理类型": 若有多个以列表形式输出。选项为["腺癌", "鳞屑样腺癌", "腺泡样腺癌", "乳头状腺癌", "微乳头状腺癌", "实性腺癌", "浸润性黏液腺癌", "混合性浸润性黏液性和非黏液性腺癌", "胶体样腺癌", "胎儿型腺癌", "肠型腺癌", "微浸润性腺癌", "原位腺癌", "粘液表皮样癌", "腺样囊性癌", "唾液腺型肿瘤", "上皮肌上皮癌", "浸润性腺癌", "肺腺癌", "鳞癌", "角化型鳞状细胞癌", "非角化型鳞状细胞癌", "基底样鳞状细胞癌", "原位鳞状细胞癌", "大细胞癌", "巨细胞癌", "小细胞癌", "小细胞肺癌", "复合型小细胞癌", "腺鳞癌", "其他病理类型的非小细胞肺癌", "侵袭前病变", "弥漫性特发性肺神经内分泌细胞增生", "多形性癌", "梭形细胞癌", "癌肉瘤", "肺母细胞瘤", "淋巴上皮瘤样癌", "NUT癌", "胸膜间皮瘤", "胸腺癌", "肉瘤样癌", "混合型非小细胞癌", "神经内分泌癌", "NA"]只有当这些词汇出现时才提取相关信息。
        }]
        输入报告：""",
    "免疫检测": """你是一个医学专家，从输入报告中提取'免疫检测'的相关信息。输出格式:[{
        "免疫检测日期": ''。
        "TPS":   又叫'TC'。
        "PDL1": ""
        "CPS": ""
        "IC": ""
    }//如果有多条免疫检测，继续列出]输入报告：""",
    "诊断": """提取报告中'诊断'记录的相关信息,输出格式:[{
        "诊断医生": "多个诊断医生以列表列出"
    }]输入报告：""",
    "肿瘤治疗": """肿瘤治疗""",
    "影像学": """影像学""",
    "疾病": """疾病""",
    "治疗用药方案": """治疗用药方案""",
    "基因检测": """基因检测""",
    "基本信息": """基本信息""",
    "合并疾病": """合并疾病""",
    "日期": """日期""",
}
